#Дана строка «Петров Иван ПОКС-29 5 4 3 2 5 4 4 5 4». Преобразовать
#информацию из строки в словарь, найти среднее арифметическое оценок,
#результаты вывести на экран.





student = {}
information = "Петров Иван ПОКС-29 5 4 3 2 5 4 4 5 4"
inf = information.split()

student['Фамилия'] = inf[0]
student['Имя'] = inf[1]
student['Группа'] = inf[2]
student['Оценки'] = inf[3:]
print(student)

o = 0
for i in student['Оценки']:
    o += int(i)

o /= len(student['Оценки'])
print(f"Среднестатистическая оценка - {o}")